[{"id":"lw2b8jvo1s84dydolqr","blogheading":"Is Ten Hag in Danger?","blogText":"Wanted: an elite manager with turning water into wine on his CV, a miracle worker who can somehow transform Manchester United as the club’s lost decade heads for its nadir.\r\n\r\nTen years after David Moyes was sacked 34 games into a six-year contract as United moved towards their lowest Premier League finish of seventh place with 64 points, England’s record 20-time champions will set a new low under Erik ten Hag. Even if – and it’s a big if – the Dutchman’s team beat Arsenal, Newcastle and Brighton in their last three Premier League matches, 63 points is the most they will end this annus horribilis on.","blogImage":"/uploads/download.jpg"},{"id":"lw2bawom9xy22otzsqu","blogheading":"United avoiding drama?","blogText":"Getafe’s president, Ángel Torres, has said the club hope to keep Mason Greenwood for another season and that he does not expect the forward to return to Manchester United at the end of the campaign.\r\n\r\nGreenwood joined Getafe on loan in September after United said they wanted to avoid him becoming a distraction despite criminal charges against him being dropped after allegations, which Greenwood denied, of attempted rape, controlling and coercive behaviour and assault. The Crown Prosecution Service said there was “no longer a realistic prospect of conviction” after key witnesses withdrew their cooperation and new material came to light.\r\n\r\nErik ten Hag’s exit may be near but when will the Manchester United cycle stop?\r\nJonathan Liew\r\nJonathan Liew\r\nRead more\r\nGreenwood has scored 10 goals in 32 appearances in all competitions for Getafe, who are 10th in La Liga.\r\n\r\n“If it was up to the lad, his ­parents and the club [Getafe], I think he would continue for another year,” Torres told Radio Marca. “But regarding Manchester [United], the news that we have from last week, where the [Getafe] sporting director went to England to see some games and was with them, is that, if a good offer comes along, they would want to sell because he is not going to go back there.","blogImage":"/uploads/download (1).jpg"},{"id":"lw2be16gcznzxdandl","blogheading":"Sir Jim wants more!","blogText":"Sir Jim Ratcliffe cited email traffic statistics to Manchester United staff as the basis for a ban on working from home and told them to seek ­“alternative employment” if they are not ­willing to come to club premises.\r\n\r\nUnited have had a flexible work-from-home policy since Covid but Ratcliffe signalled an end to this ­during an all-staff meeting held in person and via video call last week as part of his tour of Old Trafford and the Carrington training base.\r\n\r\nErik ten Hag’s exit may be near but when will the Manchester United cycle stop?\r\nJonathan Liew\r\nJonathan Liew\r\nRead more\r\nHe informed the club’s ­approximately 1,000 ­employees that email traffic dropped by 20% when one of his companies ­experimented with work-from-home Fridays, which he cited as the reason for his diktat.\r\n\r\nRatcliffe believes having all staff on site will allow greater productivity and strengthen unity and collaboration. To emphasise his message United’s ­minority owner, who uses these ­methods at Ineos, told the ­meeting: “If you don’t like it, please seek ­alternative employment.”\r\n\r\nThe news was met with bemusement by some staff, who view as shortsighted Ratcliffe’s ­explanation for changing their ­working practices. It has also become a humorous topic because there is not enough space in Manchester and at the club’s London premises to accommodate all staff owing to some being used for ­hospitality and other activities.\r\n\r\nA working group has been set up to implement Ratcliffe’s policy. Other challenges to be addressed include dealing with employees who live far from Manchester and London and the fact that some staff are on ­flexible contracts and do not have to work from club offices under their terms.","blogImage":"/uploads/download (2).jpg"},{"id":"lw2bk3arv8mm30v6bcj","blogheading":"Where is Licha?","blogText":"Manchester United's coaching staff believe their squad has too few vocal leaders and that the injured Lisandro Martínez has been sorely missed in that regard.\r\n\r\nThe defender has been unavailable for 37 of United’s 48 games this season owing to foot, knee and calf problems, including Monday’s humiliating 4-0 defeat at Crystal Palace. The Guardian understands Erik ten Hag’s coaching staff have noticed how much quieter the changing room is in Martínez’s absence and believe this had been detrimental to performances and results.\r\n\r\nMason Mount looks pained as Manchester United slump to defeat at Selhurst Park.\r\n‘We let each other down’: Ten Hag admits Manchester United at new low\r\nRead more\r\nAlthough Martínez is not the only vocal player, his presence is considered vital in creating a winning mentality and driving the squad on. The captain, Bruno Fernandes, is the on-field leader and leads by example.\r\n\r\nMartínez has played only five times since 20 September and United hope he will be available consistently next season and be a key factor in a more successful campaign after this largely disappointing one.\r\n\r\nTen Hag’s position is under renewed scrutiny after the loss at ­Palace, a 13th top-flight defeat for United this season, their highest number of losses in a Premier League campaign. With three games remaining Ten Hag’s team are eighth, a place below Chelsea, who are level on points but have a goal difference superior by 14. Seventh is the lowest league place that could lead to European qualification.\r\n\r\nUnited may need to beat Manchester City in the FA Cup final on 25 May to secure a European place and Ten Hag is set to remain in charge for that match.","blogImage":"/uploads/download (3).jpg"},{"id":"lw2bmj633ddrnoj9epr","blogheading":"Disgrace by United fans","blogText":"A football fan has been charged with causing harassment, alarm or distress over alleged tragedy chanting during a Premier League match between Manchester United and Burnley.\r\n\r\nBurnley FC said it was informed about “offensive footage” on social media from some of its travelling supporters at Old Trafford on Saturday afternoon.\r\n\r\nGreater Manchester police said it had charged Nathan Rawlinson, 44, of Bacup, Lancashire, with section 5 of the Public Order Act 1986 and that he had been bailed.\r\n\r\nThe force said: “As we have enforced recently, continued incidents of tragedy chanting by anyone will not be tolerated and will be dealt with robustly.”\r\n\r\nIt warned members of the public not to share videos of the chant on social media as Rawlinson would attend court at a later date.\r\n\r\nOn Saturday, Burnley released a club statement on X, saying: “We are aware of offensive footage currently circulating on social media from the away end of today’s fixture at Old Trafford.\r\n\r\n“Tragedy-related gesturing and chanting is completely unacceptable, and Burnley football club take a zero-tolerance approach.\r\n\r\n“We will continue to work with Greater Manchester police, Lancashire police and Manchester United to help identify and prosecute the individuals responsible.”\r\n\r\nThe Premier League said anyone found guilty would be punished, saying on X: “There is no place for football tragedy abuse in our game. We strongly condemn this behaviour and sanctions are in place to ensure anybody found guilty faces consequences.\r\n\r\n“We continue to treat this as an unacceptable issue and fully support Burnley FC, Manchester United and the police in identifying and prosecuting those responsible.”","blogImage":"/uploads/images.jpg"},{"id":"lw2bopco8bq2ilj85f3","blogheading":"United 250th Academy star","blogText":"The quarter of a millennia has been 93 years in the making at Old Trafford and it was poignant that a local lad, Ethan Wheatley, became the 250th academy graduate to make their debut for Manchester United’s senior men’s team on Wednesday night.\r\n\r\nThe 18-year-old had spent the previous evening scoring two goals to help defeat Manchester City to win the Premier League Cup. Wheatley, who like his teammate Kobbie Mainoo was born in Stockport, became the 101st player from Greater Manchester to make the leap from academy to elite when he replaced Rasmus Højlund late on against Sheffield United.\r\n\r\nRhys Bennett of Manchester United lifts the FA Youth Cup in May 2022.\r\nManchester United’s kids are all right after tough love in the lower leagues\r\nRead more\r\nIn 1931 the half-back Tom Manley became the first to progress through the ranks and there has been a graduate in every matchday squad for more than 4,000 matches since 1937. United have won 11 FA Youth Cups, two more than anyone else, with the most recent coming under the guidance of Travis Binnion in 2022 when Mainoo and Alejandro Garnacho were in the team. Development is at the heart of what United do but, equally, they realise that winning is a good habit to learn at an early age.\r\n\r\n“I would suggest it [the academy] is one of the core ingredients of Manchester United, both in the modern day and throughout history,” says their director of academy, Nick Cox. “Academies or youth development programmes were designed years ago as a cheap way of building a first-team squad. There wasn’t much money in the game and chairmen couldn’t afford to run football clubs. What happened here was that we carried on playing after the [second] world war because we had a youth programme running, so our club stayed alive playing quickly after the war because of our youth programme.\r\n\r\n“We survived Munich because of our youth programme. We survived tough days, when maybe it wasn’t going so well on the pitch in the 1970s, because of our youth programme. But then you look at our greatest successes and see when we have won Champions Leagues and league titles, young players have been at the heart of it.”\r\n\r\nSir Jim Ratcliffe has made it known that he regards a prosperous academy as a great asset. While the first team have underwhelmed this season, Adam Lawrence’s under-18s have won their league, losing one of 22 matches, before adding the Premier League Cup at Leigh on Tuesday under the watchful gaze of the new technical director, Jason Wilcox. The former Blackburn winger previously worked as academy director at Manchester City so will take a keen interest in the youth setup at United, where he will oversee coaching methodology and player pathways.\r\n\r\n","blogImage":"/uploads/maxresdefault.jpg"}]